IRP/src/Catalogs/PlanningPeriods/PlanningPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PlanningPeriods</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>IsFinancial</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsManufacturing</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsSalary</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>BusinessUnits</name>
  <attributes>
   <name>BusinessUnit</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PlanningPeriods/ObjectModule.bsl
Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
	 	If FillingData.Property("BusinessUnit") And ValueIsFilled(FillingData.BusinessUnit) Then
			ThisObject.BusinessUnits.Add().BusinessUnit = FillingData.BusinessUnit;
			ThisObject.IsManufacturing = True;
		EndIf;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.IsFolder Then
		Return;
	EndIf;
	If ThisObject.BeginDate > ThisObject.EndDate Then
		Cancel = True;
		MessageText = StrTemplate(R().MF_Error_006, ThisObject.BeginDate, ThisObject.EndDate);
		CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.BeginDate", "Object");
	EndIf;
	
	If Cancel = True Then
		Return;
	EndIf;
	
	For Each Row In ThisObject.BusinessUnits Do
		ArrayOfErrors = CheckDates(ThisObject.Ref, Row.BusinessUnit, ThisObject.BeginDate, ThisObject.EndDate);
		For Each ItemOfErrors In ArrayOfErrors Do
			Cancel = True;
			If ItemOfErrors.BeginDate Then
				MessageText = StrTemplate(R().MF_Error_007, ThisObject.BeginDate, ItemOfErrors.Period);
				CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.BeginDate", "Object");
			EndIf;
			
			If ItemOfErrors.EndDate Then
				MessageText = StrTemplate(R().MF_Error_008, ThisObject.EndDate, ItemOfErrors.Period);
				CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.EndDate", "Object");
			EndIf;
		EndDo;
	EndDo;
EndProcedure

Function CheckDates(Ref, BusinessUnit, BeginDate, EndDate)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	PlanningPeriods.Ref AS Ref,
	|	CASE
	|		WHEN &BeginDate BETWEEN PlanningPeriods.BeginDate AND PlanningPeriods.EndDate
	|		OR PlanningPeriods.BeginDate BETWEEN &BeginDate AND &EndDate
	|			THEN TRUE
	|		ELSE FALSE
	|	END AS BeginDate,
	|	CASE
	|		WHEN &EndDate BETWEEN PlanningPeriods.BeginDate AND PlanningPeriods.EndDate
	|		OR PlanningPeriods.EndDate BETWEEN &BeginDate AND &EndDate
	|			THEN TRUE
	|		ELSE FALSE
	|	END AS EndDate
	|FROM
	|	Catalog.PlanningPeriods.BusinessUnits AS PlanningPeriodsBusinessUnits
	|		INNER JOIN Catalog.PlanningPeriods AS PlanningPeriods
	|		ON PlanningPeriodsBusinessUnits.Ref = PlanningPeriods.Ref
	|		AND PlanningPeriodsBusinessUnits.BusinessUnit = &BusinessUnit
	|		AND PlanningPeriodsBusinessUnits.Ref <> &Ref
	|		AND PlanningPeriods.Ref <> &Ref
	|		AND (&BeginDate BETWEEN PlanningPeriods.BeginDate AND PlanningPeriods.EndDate
	|		OR &EndDate BETWEEN PlanningPeriods.BeginDate AND PlanningPeriods.EndDate
	|		OR (PlanningPeriods.BeginDate BETWEEN &BeginDate AND &EndDate
	|		OR PlanningPeriods.EndDate BETWEEN &BeginDate AND &EndDate))";
	Query.SetParameter("Ref", Ref);
	Query.SetParameter("BusinessUnit" , BusinessUnit);
	Query.SetParameter("BeginDate"    , BeginDate);
	Query.SetParameter("EndDate"      , EndDate);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	ArrayOfErrors = New Array();
	While QuerySelection.Next() Do
		PeriodError = New Structure();
		PeriodError.Insert("BeginDate" , QuerySelection.BeginDate);
		PeriodError.Insert("EndDate"   , QuerySelection.EndDate);
		PeriodError.Insert("Period"    , QuerySelection.Ref);
		ArrayOfErrors.Add(PeriodError);
	EndDo;
	Return ArrayOfErrors;
EndFunction
